# Excluding Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredElementCollector..::..Excluding Method
FilteredElementCollector Class See Also
---
Applies an ExclusionFilter to the collector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilteredElementCollector Excluding(
	ICollection<ElementId> idsToExclude
)
```

Visual Basic
---
```text
Public Function Excluding ( _
	idsToExclude As ICollection(Of ElementId) _
) As FilteredElementCollector
```

Visual C++
---
```text
public:
FilteredElementCollector^ Excluding(
	ICollection<ElementId^>^ idsToExclude
)
```

# ### Parameters
idsToExclude
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The ids to exclude from the results.
# ### Return Value
A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
# Remarks
Elements passed to this filter will be automatically excluded from the results. If you have an active iterator to this collector it will be stopped by this call.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input collection of ids was empty, or its contents were not valid for iteration. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilteredElementCollector Class
Autodesk.Revit.DB Namespace